
&НаКлиенте
Процедура ЗатратыОбновить(Команда)
    ЗаполнитьЗатраты();
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьОстатки()
    Остатки.Загрузить(РегистрыНакопления.Кошельки.Остатки());
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗатраты()
    Затраты.Загрузить(РегистрыНакопления.Затраты.Обороты());
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ЗаполнитьОстатки();
    ЗаполнитьЗатраты();
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиОбновить(Команда)
    ЗаполнитьОстатки();
КонецПроцедуры
